app/controllers/cabbage_patches_controller.rb

  def index
    @cabbage_patches = CabbagePatch.all
---
SELECT "cabbage_patches".* FROM "cabbage_patches"

  def create
    @cabbage_patch = CabbagePatch.new(cabbage_patch_params)

    if @cabbage_patch.save
---
INSERT INTO "cabbage_patches" ("date", "subject", "summery", "message", "picture1", "picture2", "picture3", "picture4", "picture5", "picture6", "picture7", "picture8", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def destroy
    @cabbage_patch.destroy
---
DELETE FROM "cabbage_patches" WHERE "cabbage_patches"."id" = $1  [["id", 1]]

    def set_cabbage_patch
      @cabbage_patch = CabbagePatch.find(params[:id])
---
SELECT "cabbage_patches".* FROM "cabbage_patches" WHERE "cabbage_patches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]