app/controllers/corporates_controller.rb

  def index
    @corporates = Corporate.all
---
SELECT "corporates".* FROM "corporates"

  def create
    @corporate = Corporate.new(corporate_params)

    if @corporate.save
---
INSERT INTO "corporates" ("email", "subject", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "mekadhay@gmail.com"], ["subject", "happy hour party"], ["message", "stuff for people"], ["created_at", "2021-01-29 17:20:46.079478"], ["updated_at", "2021-01-29 17:20:46.079478"]]

  def destroy
    @corporate.destroy
---
DELETE FROM "corporates" WHERE "corporates"."id" = $1  [["id", 1]]

    def set_corporate
      @corporate = Corporate.find(params[:id])
---
SELECT "corporates".* FROM "corporates" WHERE "corporates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]