app/controllers/customs_controller.rb

SELECT "customs".* FROM "customs"
---
  def index
    @customs = Custom.all

INSERT INTO "customs" ("first_name", "last_name", "email", "subject", "message", "price_range", "delivery_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @custom = Custom.new(custom_params)

    if @custom.save

DELETE FROM "customs" WHERE "customs"."id" = $1  [["id", 1]]
---
  def destroy
    @custom.destroy

SELECT "customs".* FROM "customs" WHERE "customs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_custom
      @custom = Custom.find(params[:id])