app/controllers/get_in_touches_controller.rb

  def index
    @get_in_touches = GetInTouch.all
---
SELECT "get_in_touches".* FROM "get_in_touches"

  def create
    @get_in_touch = GetInTouch.new(get_in_touch_params)

    if @get_in_touch.save
---
INSERT INTO "get_in_touches" ("first_name", "last_name", "email", "subject", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @get_in_touch.destroy
---
DELETE FROM "get_in_touches" WHERE "get_in_touches"."id" = $1  [["id", 1]]

    def set_get_in_touch
      @get_in_touch = GetInTouch.find(params[:id])
---
SELECT "get_in_touches".* FROM "get_in_touches" WHERE "get_in_touches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]