app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "picture1", "picture2", "picture3", "picture4", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    if @product.save

UPDATE "products" SET "name" = $1, "price" = $2, "description" = $3, "picture1" = $4, "picture2" = $5, "picture3" = $6, "picture4" = $7, "updated_at" = $8 WHERE "products"."id" = $9  [["name", ""], ["price", "150.0"], ["description", ""], ["picture1", ""], ["picture2", ""], ["picture3", ""], ["picture4", ""], ["updated_at", "2021-02-02 23:28:49.223711"], ["id", 1]]
---
  def update
    if @product.update(product_params)