app/controllers/users_controller.rb

  def login
    user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Gollum"], ["LIMIT", 1]]